#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.aws_iam_role.carguero-technical-challenge-node-role: Refreshing state... [id=carguero-technical-challenge-node-role]
module.eks.data.aws_availability_zones.available: Reading...
module.rds.data.aws_availability_zones.available: Reading...
module.eks.aws_vpc.carguero-technical-challenger-vpc: Refreshing state... [id=vpc-0e8856d5717fbf58b]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
module.rds.aws_vpc.carguero-technical-challenger-db-vpc: Refreshing state... [id=vpc-0f5ebe29ad6533321]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
module.eks.aws_iam_role.carguero-technical-challenge-iam-role: Refreshing state... [id=carguero-technical-challenge-role]
module.eks.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.rds.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506492700000002]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506522100000003]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506488500000001]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506529200000004]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506556900000005]
module.eks.aws_subnet.carguero-technical-challenger-subnet[0]: Refreshing state... [id=subnet-0150929ea866ddf53]
module.eks.aws_internet_gateway.carguero-technical-challenger-ig: Refreshing state... [id=igw-013916cb64494d713]
module.eks.aws_subnet.carguero-technical-challenger-subnet[1]: Refreshing state... [id=subnet-029f7804348303b71]
module.eks.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-06e1de82fbecb0abc]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[1]: Refreshing state... [id=subnet-0f777c58cf88d761e]
module.rds.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-03ec0cd54d7729830]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[0]: Refreshing state... [id=subnet-073b8d2f78446906b]
module.rds.aws_internet_gateway.carguero-technical-challenger-db-ig: Refreshing state... [id=igw-0a103f683858d278f]
module.eks.aws_route_table.carguero-technical-challenger-rt: Refreshing state... [id=rtb-005d7ca7ed3f7cd05]
module.eks.aws_eks_cluster.carguero-technical-challenge: Refreshing state... [id=carguero-technical-challenge-cluster]
module.rds.aws_db_subnet_group.carguero-technical-challenge-db-subnet-group: Refreshing state... [id=carguero-technical-challenge-db-subnet-group]
module.rds.aws_route_table.carguero-technical-challenger-db-rt: Refreshing state... [id=rtb-0018cc55739d82717]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0cce6e38f44a77697]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-0afe8d822d4172369]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-04308652869acc250]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0fa260a94dbd6848f]
module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[1]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-2]
module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-1]
module.rds.aws_db_instance.carguero-technical-challenge-db: Refreshing state... [id=db-DMLPOKWUYPKMJEQDPLIIF7RT4Y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.carguero-technical-challenge must be replaced
-/+ resource "aws_eks_cluster" "carguero-technical-challenge" {
      ~ arn                       = "arn:aws:eks:us-east-1:140280519783:cluster/carguero-technical-challenge-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EWXhPREl6TVRBeE1Wb1hEVE16TURZeE5USXpNVEF4TVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBS1JVCjY3c0Q3RkNoWUw2Y1daaVRiSUwwbGFzZndycHVUK2JTdnJUbG1mWW9SNDFrTE55TDBYOXVsRVBOc3hPOER6UngKVENUd09XRm9DOUQ0Qm1TaTk0c28ybHk5dTArMGRPOWFsSVZmUUJlOVlRY3FOeUw3SW84NTg3enREb28rbWMwRQo0U056bUh4TFBFQzdXQTN2cW5XTFIyMTczbDh4UDkrZXJDSHl1YVZZLzN1ZFdYMmdPOE85RVh0NXBpOEo2SXgvClF0YmZOZG5rL0hvNFVxV1Q0eWg1SUV5OWhDdzBDOFExcFB3aGZpbzI1YTVWVDNnRjl1MTRCSDNzTmRESVhpREUKc2RhQWJoWWRIU2FiT3V3eGgyVU1vTDBoZTB5Q0R1OGpyQ3hIWWIrWFRSckU0SlVMZW5YSXltcDVGWEd4YlViMwoyVmRFS2dWQnJXV2VDZGdVQkljQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZOOTVmNjJlY3lrVGNZSVhXaWE5RjJaUHVkbUhNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBR0VDazVTWnU2R2VDdVRUQ1orTgpPR2RxSE1haTdUMTMzblNJejhDeW5zdE1FalFjR0VucnAwTkZtc3NkZUJTbDVEc1hUazAyaHRpZS9ZVVJPZlBRCmw4dDVTNFh6U1BMSTBnNzFweTZiY1FWR2t0bUhLY3B5VVIycUFnaDNKOHlYakR1cDd5S3JoaGV3aDBuWDVOUTcKUXNrS091L3pWbzVDMnNmRGxNTy9QMm8wNDROZzhEL1VxSFNrNzl4SWJXc3laMWxKRnpjTGFJRzR6T0oxYkFWRQoxWDdUUHRLcS84QXZTbU5GZ0VsVHdqRGdlY2xpNlhtUWFMSVZEU25aclFnOVNoU1EvZlhBNURWaS9wWFZwdGFECkNQM2RZTzQ1ZU81WnNFVExDZXcxL0hIa0Znd2RnaEUzUjZvcDhuT0drUVB0M1RMaHdHK3E5U3ljN2p0RjBieGkKZEtjPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-06-18 23:05:19.339 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://C33E19311BD0FC5A083D7600BDE109B7.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "carguero-technical-challenge-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/C33E19311BD0FC5A083D7600BDE109B7"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "carguero-technical-challenge-cluster" -> "carguero-technical-challenge-cluster-2" # forces replacement
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
        # (3 unchanged attributes hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0a5ac8c34c6f04bb0" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-0e8856d5717fbf58b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0] must be replaced
-/+ resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:140280519783:nodegroup/carguero-technical-challenge-cluster/carguero-technical-challenge-node-1/b8c46864-4e23-0d17-6680-deda15afb832" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "carguero-technical-challenge-cluster" -> "carguero-technical-challenge-cluster-2" # forces replacement
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "carguero-technical-challenge-cluster:carguero-technical-challenge-node-1" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.27.1-20230607" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-carguero-technical-challenge-node-1-b8c46864-4e23-0d17-6680-deda15afb832"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "carguero-technical-challenge-node-1"
        }
      ~ version                = "1.27" -> (known after apply)
        # (5 unchanged attributes hidden)

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[1] must be replaced
-/+ resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:140280519783:nodegroup/carguero-technical-challenge-cluster/carguero-technical-challenge-node-2/e2c46864-4e35-9fba-8d72-f513601a320e" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "carguero-technical-challenge-cluster" -> "carguero-technical-challenge-cluster-2" # forces replacement
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "carguero-technical-challenge-cluster:carguero-technical-challenge-node-2" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.27.1-20230607" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-carguero-technical-challenge-node-2-e2c46864-4e35-9fba-8d72-f513601a320e"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "carguero-technical-challenge-node-2"
        }
      ~ version                = "1.27" -> (known after apply)
        # (5 unchanged attributes hidden)

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.eks.helm_release.nginx-ingress-controller will be created
  + resource "helm_release" "nginx-ingress-controller" {
      + atomic                     = false
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*